# Parameters
nc: 1
scales:
  #n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  #s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  #l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  #x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# HG-YOLO backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, LDS, [32]] # 0: HGStem (mid, out) - (32, 160, 160)
  - [-1, 1, HGBlock, [64, 32]] # 1: HGBlock - (32, 160, 160)

  - [-1, 1, LDS, [64]] # 2: Conv2d (out, kernel, stride, padding) - (64, 80, 80)
  - [-1, 1, HGBlock, [128, 64]] # 3: HGBlock - (64, 80, 80)

  - [-1, 1, LDS, [128, 3, 2, 1]] # 4: Conv2d
  - [-1, 1, HGBlock, [256, 128]] # 5: HGBlock - (64, 40, 40)

  - [-1, 1, LDS, [256, 3, 2, 1]] # 5: Conv2d
  - [-1, 1, HGBlock, [512, 256]] # 7: HGBlock - (64, 20, 20)

  - [-1, 1, SPPF, [256, 7]] # 8
  - [-1, 1, C2PSA, [256]] # 9: C2PSA (out_channels - must be the same as the in_channels)

  ### Neck
  # Upsampling
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 5], 1, Concat, [1]] # 11
  - [-1, 1, RepNCSPELAN4, [256, 512, 256, 2]] # 12: RepNCSPELAN4 (out,, interm ch, interm RepCSP ch, number of RepCSP) -> so big

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 3], 1, Concat, [1]] # 14
  - [-1, 1, RepNCSPELAN4, [64, 128, 64, 2]] # 15: RepNCSPELAN4

  # Downsampling
  - [-1, 1, Conv, [256, 3, 2, 1]] # 16: Conv2d
  - [[-1, 12], 1, Concat, [1]] # 17
  - [-1, 1, RepNCSPELAN4, [128, 256, 128, 2]] # 18: RepNCSPELAN4

  - [-1, 1, Conv, [256, 3, 2, 1]] # 19: Conv2d
  - [[-1, 7], 1, Concat, [1]] # 20
  - [-1, 1, RepNCSPELAN4, [256, 512, 256, 2]] # 21: RepNCSPELAN4-

  # GAM
  - [15, 1, GlobalAttentionMechanism, []] # 22: GAM
  - [18, 1, GlobalAttentionMechanism, []] # 23: GAM
  - [21, 1, GlobalAttentionMechanism, []] # 24: GAM

# Head
head:
  - [[22, 23, 24], 1, Detect, [nc]] # 22: Detect(P3, P4, P5)